[
    {
        "title": "Tune In To #VCTAmericas LIVE!",
        "category": "ESPORTS",
        "date": "24/4/2025",
        "thumbnail": "https://cmsassets.rgpub.io/sanity/images/dsfx7636/news_live/385d0a58e256d11ba7f42df1336595ba8b7e153d-1920x1080.jpg?auto=format&fit=fill&q=80&w=480",
        "content": "",
        "youtube": "https://www.youtube.com/watch?v=XEm9tWzpRBs"
    },
    {
        "title": "VALORANT Patch Notes 10.07",
        "category": "GAME UPDATES",
        "date": "15/4/2025",
        "thumbnail": "https://cmsassets.rgpub.io/sanity/images/dsfx7636/news/1c1776bd1bdd921061a53953d81a393ef69ce633-1920x1080.jpg?auto=format&fit=fill&q=80&w=480",
        "content": "<p>Rise and shine, gamers, another patch has dropped!</p><p>Lots of bug fixes for PC and console—fixes for nine Agents and some UI improvements here and there. For console, you can now see the Timeline view as part of the End of Game and Match Details screens where you can review the events of the match round by round (for Competitive, Swiftplay, and Unrated).</p><p>Hope everyone has been keeping up with VCT because there’s only 1 month left before we know who’s moving on to Masters Toronto. What team are you rooting for?</p><p>Have a good one!</p><p>-Ash</p><hr><h2>ALL PLATFORMS</h2><h4>BUG FIXES</h4><ul><li><strong>Agents</strong><ul><li><strong>Reyna</strong>: Fixed an issue where Reyna’s ultimate visuals could show through nearsights.</li><li><strong>Waylay</strong>: Fixed an issue so Waylay will teleport properly back if she activates her Refract while picking up an ult orb. Fixed an issue where Waylay could activate Refract outside of the playable space on Abyss. Fixed an issue so Waylay should no longer end looking straight up in the air when she triggers Refract return when she's directly above the teleport point.</li><li><strong>KAY/O</strong>: Fixed an issue where KAY/O’s revive SFX would persist after being killed while being resurrected by an ally during NULL/CMD.</li><li><strong>Vyse</strong>: Fixed an issue where enemies could get stuck inside Vyse’s wall if the wall was overlapping with a smoke ability at specific times. Fixed an issue where enemies could get stuck in Vyse’s Shear if they jumped when it was triggered. Fixed an issue where Vyse’s Shear’s SFX could get stuck playing for enemies after moving out of range or if Vyse dies.</li><li><strong>Clove</strong>: Fixed an issue where Clove’s Ruse battlefield view could be seen from underneath elevated locations while they have it equipped. Fixed an issue where Clove’s Pick-Me-Up duration was incorrect for observer/spectator clients.</li><li><strong>Cypher</strong>: Fixed an issue where opponents who teleported out of the Trapwire after being hit could run through the same reactivated wire without getting tethered.</li><li><strong>Tejo</strong>: Fixed an issue where Armageddon’s floor indicator persisted across rounds.</li><li><strong>Omen</strong>: Fixed an issue where Omen could not see properly when casting Dark Cover if he was overlapping another dense smoke (smokes that obscure vision inside, e.g. Jett Cloudburst, Brimstone Sky Smoke, etc.).</li><li><strong>Deadlock</strong>: Fixed an issue where Deadlock’s netted VFX could show through thin walls.</li><li><strong>Sova</strong>: Fixed an issue where Sova’s arm and Drone overlapped each other in Agent Select.</li><li><strong>Chamber</strong>: Fixed an issue where Chamber’s watch and glasses could be seen while nearsighted.</li></ul></li><li><strong>General</strong>: Fixed a bug that caused the Bolt weapons skin to sometimes glow brighter than intended and cause some photosensitivity issues.</li></ul><h4>PC ONLY</h4><ul><li><strong>Competitive Updates</strong>: Fixed an issue in Match History and End of Game screens where hover text was missing from the Rank Shield icon if you had no Rank Shields remaining.</li><li><strong>Player Behavior</strong>: Fixed an issue where Riot IDs written in certain languages were displayed with a cutoff in the Social Panel.</li><li><strong>Premier</strong>: Fixed an issue where text sometimes did not fit in dropdowns on the Standings page.</li></ul><h4>CONSOLE ONLY</h4><h5>COMPETITIVE UPDATES</h5><p>We’ve added the Timeline view as part of the End of Game and Match Details screens where you can review the events of the match round by round. This view is only available for Competitive, Swiftplay, and Unrated matches.</p><h5>BUG FIXES</h5><ul><li><strong>Agents - Omen</strong>: Fixed an issue where Omen’s Dark Cover targeting sensitivity could get stuck at a lower value until his next smoke cast if he died while attempting to cast Dark Cover.</li><li><strong>Competitive Updates</strong>: Fixed an issue on the leaderboard page where repeatedly switching between the filters and scrolling through entries on the page could cause you to lose the ability to select a different entry.</li><li><strong>Player Behavior</strong>: Fixed an issue where players with long usernames overlapped with console logos in the Social Panel. Fixed an issue where sending a party invite to an Invalid Riot ID would lock the invite window until it was closed and reopened.</li></ul>"          
    },
    {
        "title": "VCT Ascended team bundles are now available",
        "category": "GAME UPDATES",
        "date": "9/4/2025",
        "thumbnail": "https://cmsassets.rgpub.io/sanity/images/dsfx7636/news/55466235d285ed40d7efcbbec2f94aff1c0f5bea-1920x1080.jpg?auto=format&fit=fill&q=80&w=480",
        "content": "Celebrate the VCT Ascended teams with exclusive bundles! Show your support and grab these limited-time items before they're gone."
    },
    {
        "title": "Introducing the VCT Americas Watch Party Program",
        "category": "ESPORTS",
        "date": "8/4/2025",
        "thumbnail": "https://cmsassets.rgpub.io/sanity/images/dsfx7636/news/5779bcf249685b1fb73b473fc1f35bcd42985c3f-1920x1080.jpg?auto=format&fit=fill&q=80&w=480",
        "content": "We're excited to announce the VCT Americas Watch Party Program! Join fellow fans and experience the thrill of esports together."
    },
    {
        "title": "April Fools: Smite 2 Reveal",
        "category": "GAME UPDATES",
        "date": "1/4/2025",
        "thumbnail": "https://cmsassets.rgpub.io/sanity/images/dsfx7636/news/2b0e7b3491c9ad54a5f508294d7d8f5c7be78bc9-1920x1080.jpg?auto=format&fit=fill&q=80&w=480",
        "content": "Happy April Fools! Smite 2 is here... or is it? Enjoy the fun and surprises we've prepared for you this year."
    },
    {
        "title": "VALORANT Patch Notes 10.06",
        "category": "GAME UPDATES",
        "date": "1/4/2025",
        "thumbnail": "https://cmsassets.rgpub.io/sanity/images/dsfx7636/news/f8d663f096bd319dffdc300edcfc2185fa8a41c5-1920x1080.jpg?auto=format&fit=fill&q=80&w=480",
        "content": "Patch 10.06 is live! Check out the latest changes, including new features, bug fixes, and gameplay improvements."
    },
    {
        "title": "A spectrum of colors: Waylay art from the community",
        "category": "COMMUNITY",
        "date": "28/3/2025",
        "thumbnail": "https://cmsassets.rgpub.io/sanity/images/dsfx7636/news/df0dde25145c5308e92518eca4b9f164c13dadc8-1920x1080.jpg?auto=format&fit=fill&q=80&w=480",
        "content": "Explore the vibrant art created by our talented community. From fan art to creative projects, celebrate the spectrum of colors in Waylay."
    },
    {
        "title": "Watch the VCT Americas 2025 Stage 1 Trailer",
        "category": "ESPORTS",
        "date": "21/3/2025",
        "thumbnail": "https://cmsassets.rgpub.io/sanity/images/dsfx7636/news/835603e3cb18f8f19002c248e8671d357f4b62e3-1920x1080.jpg?auto=format&fit=fill&q=80&w=480",
        "content": "Get hyped for VCT Americas 2025 Stage 1 with our official trailer. Witness the journey of the best teams as they compete for glory."
    },
    {
        "title": "Pros Make Player Tier Lists",
        "category": "ESPORTS",
        "date": "20/3/2025",
        "thumbnail": "https://cmsassets.rgpub.io/sanity/images/dsfx7636/news/ea27896f13f44e2daea73d39ac78cf109e5dc26d-1920x1080.jpg?auto=format&fit=fill&q=80&w=480",
        "content": "Ever wondered how pros rank their peers? Check out the player tier lists created by top players in the scene."
    },
    {
        "title": "Masters Toronto: Live audience and ticket sale information",
        "category": "ESPORTS",
        "date": "18/3/2025",
        "thumbnail": "https://cmsassets.rgpub.io/sanity/images/dsfx7636/news/e9a783f5d8f6a11792ef5eb090d78da605cb1655-1920x1080.jpg?auto=format&fit=fill&q=80&w=480",
        "content": "Masters Toronto is coming! Get all the details about live audience access and ticket sales for this exciting event."
    },
    {
        "title": "VALORANT Patch Notes 10.05",
        "category": "GAME UPDATES",
        "date": "18/3/2025",
        "thumbnail": "https://cmsassets.rgpub.io/sanity/images/dsfx7636/news/91281d11585af58e5906204140aee4cbdf5a34a0-1920x1080.jpg?auto=format&fit=fill&q=80&w=480",
        "content": "Patch 10.05 is here! Dive into the latest updates, including new features, bug fixes, and gameplay adjustments."
    },
    {
        "title": "VCT 2025 Stage 1 Hype Trailer",
        "category": "ESPORTS",
        "date": "13/3/2025",
        "thumbnail": "https://cmsassets.rgpub.io/sanity/images/dsfx7636/news/f96ae76c8e4e36058e827981e6189da40568fc42-1920x1080.jpg?auto=format&fit=fill&q=80&w=480",
        "content": "Feel the excitement with the VCT 2025 Stage 1 Hype Trailer. Get ready for an unforgettable season of competitive VALORANT."
    }
]