[
    {
        "title": "Tune In To #VCTAmericas LIVE!",
        "category": "ESPORTS",
        "date": "24/4/2025",
        "thumbnail": "https://cmsassets.rgpub.io/sanity/images/dsfx7636/news_live/385d0a58e256d11ba7f42df1336595ba8b7e153d-1920x1080.jpg?auto=format&fit=fill&q=80&w=480",
        "content": "",
        "youtube": "https://www.youtube.com/watch?v=XEm9tWzpRBs"
    },
    {
        "title": "VALORANT Patch Notes 10.07",
        "category": "GAME UPDATES",
        "date": "15/4/2025",
        "thumbnail": "https://cmsassets.rgpub.io/sanity/images/dsfx7636/news/1c1776bd1bdd921061a53953d81a393ef69ce633-1920x1080.jpg?auto=format&fit=fill&q=80&w=480",
        "content": "<p>Rise and shine, gamers, another patch has dropped!</p>\n<p>Lots of bug fixes for PC and console—fixes for nine Agents and some UI improvements here and there. For console, you can now see the Timeline view as part of the End of Game and Match Details screens where you can review the events of the match round by round (for Competitive, Swiftplay, and Unrated).</p>\n<p>Hope everyone has been keeping up with VCT because there’s only 1 month left before we know who’s moving on to Masters Toronto. What team are you rooting for?</p>\n<p>Have a good one!</p>\n<p>-Ash</p>\n<h3>ALL PLATFORMS</h3>\n<h4>BUG FIXES</h4>\n<h5>Agents</h5>\n<ul>\n  <li><strong>Reyna</strong><br>Fixed an issue where Reyna’s ultimate visuals could show through nearsights.</li>\n  <li><strong>Waylay</strong>\n    <ul>\n      <li>Fixed an issue so Waylay will teleport properly back if she activates her Refract while picking up an ult orb.</li>\n      <li>Fixed an issue where Waylay could activate Refract outside of the playable space on Abyss.</li>\n      <li>Fixed an issue so Waylay should no longer end looking straight up in the air when she triggers Refract return when she's directly above the teleport point.</li>\n    </ul>\n  </li>\n  <li><strong>KAY/O</strong><br>Fixed an issue where KAY/O’s revive SFX would persist after being killed while being resurrected by an ally during NULL/CMD.</li>\n  <li><strong>Vyse</strong>\n    <ul>\n      <li>Fixed an issue where enemies could get stuck inside Vyse’s wall if the wall was overlapping with a smoke ability at specific times.</li>\n      <li>Fixed an issue where enemies could get stuck in Vyse’s Shear if they jumped when it was triggered.</li>\n      <li>Fixed an issue where Vyse’s Shear’s SFX could get stuck playing for enemies after moving out of range or if Vyse dies.</li>\n    </ul>\n  </li>\n  <li><strong>Clove</strong><br>Fixed an issue where Clove’s Ruse battlefield view could be seen from underneath elevated locations while they have it equipped.</li>\n  <li><strong>Cypher</strong><br>Fixed an issue where opponents who teleported out of the Trapwire after being hit could run through the same reactivated wire without getting tethered.</li>\n  <li><strong>Tejo</strong><br>Fixed an issue where Armageddon’s floor indicator persisted across rounds.</li>\n  <li><strong>Omen</strong><br>Fixed an issue where Omen could not see properly when casting Dark Cover if he was overlapping another dense smoke.</li>\n  <li><strong>Clove</strong><br>Fixed an issue where Clove’s Pick-Me-Up duration was incorrect for observer/spectator clients.</li>\n  <li><strong>Deadlock</strong><br>Fixed an issue where Deadlock’s netted VFX could show through thin walls.</li>\n  <li><strong>Sova</strong><br>Fixed an issue where Sova’s arm and Drone overlapped each other in Agent Select.</li>\n  <li><strong>Chamber</strong><br>Fixed an issue where Chamber’s watch and glasses could be seen while nearsighted.</li>\n</ul>\n<h5>General</h5>\n<ul>\n  <li>Fixed a bug that caused the Bolt weapons skin to sometimes glow brighter than intended and cause some photosensitivity issues.</li>\n</ul>\n<h3>PC ONLY</h3>\n<h4>BUG FIXES</h4>\n<ul>\n  <li><strong>Competitive Updates</strong><br>Fixed an issue in Match History and End of Game screens where hover text was missing from the Rank Shield icon if you had no Rank Shields remaining.</li>\n  <li><strong>Player Behavior</strong><br>Fixed an issue where Riot IDs written in certain languages were displayed with a cutoff in the Social Panel.</li>\n  <li><strong>Premier</strong><br>Fixed an issue where text sometimes did not fit in dropdowns on the Standings page.</li>\n</ul>\n<h3>CONSOLE ONLY</h3>\n<h4>COMPETITIVE UPDATES</h4>\n<ul>\n  <li>We’ve added the Timeline view as part of the End of Game and Match Details screens where you can review the events of the match round by round. This view is only available for Competitive, Swiftplay, and Unrated matches.</li>\n</ul>\n<h4>BUG FIXES</h4>\n<ul>\n  <li><strong>Agents</strong><br>Omen: Fixed an issue where Omen’s Dark Cover targeting sensitivity could get stuck at a lower value until his next smoke cast if he died while attempting to cast Dark Cover.</li>\n  <li><strong>Competitive Updates</strong><br>Fixed an issue on the leaderboard page where repeatedly switching between the filters and scrolling through entries on the page could cause you to lose the ability to select a different entry.</li>\n  <li><strong>Player Behavior</strong>\n    <ul>\n      <li>Fixed an issue where players with long usernames overlapped with console logos in the Social Panel.</li>\n      <li>Fixed an issue where sending a party invite to an Invalid Riot ID would lock the invite window until it was closed and reopened.</li>\n    </ul>\n  </li>\n</ul>"
    },
    {
        "title": "VCT Ascended team bundles are now available",
        "category": "GAME UPDATES",
        "date": "9/4/2025",
        "thumbnail": "https://cmsassets.rgpub.io/sanity/images/dsfx7636/news/55466235d285ed40d7efcbbec2f94aff1c0f5bea-1920x1080.jpg?auto=format&fit=fill&q=80&w=480",
        "content": "<p>The ascended teams are joining the 2025 VCT Team Capsules collection! This time, let’s give a warm welcome to:</p>\n<ul>\n  <li>2Game Esports (Americas)</li>\n  <li>Apeks (EMEA)</li>\n  <li>Xi Lai Gaming (CN)</li>\n  <li>Nongshim Redforce and BOOM Esports (Pacific)</li>\n</ul>\n<p>This new wave of team bundles includes the same features the VCT partnered team capsules released earlier this year.</p>\n<p><strong>Here’s what you can expect in each Team Capsule:</strong></p>\n<ul>\n  <li>Upgraded Classic Skin with team-themed design and new branding elements.</li>\n  <li>Achievement Tracker Inspect for teams with the accolades of major victories.</li>\n  <li>2025 Player Card with a premium finish, showcasing team identity and creativity.</li>\n  <li>Spray and Gun Buddy to show which teams you support.</li>\n</ul>\n<h3>When Can You Grab Them?</h3>\n<p>The 2025 Ascended Team Capsules will be available throughout the season in the in-game Esports Store.</p>"
    },
    {
        "title": "Introducing the VCT Americas Watch Party Program",
        "category": "ESPORTS",
        "date": "8/4/2025",
        "thumbnail": "https://cmsassets.rgpub.io/sanity/images/dsfx7636/news/5779bcf249685b1fb73b473fc1f35bcd42985c3f-1920x1080.jpg?auto=format&fit=fill&q=80&w=480",
        "content": "<p>The VCT Americas Watch Party Program is officially launching, and it's all about you: the fans.</p>\n<p>Riot Games invites VALORANT fans, community leaders, and local businesses from North America, Latin America, and Brazil to join us in creating unforgettable watch party experiences with the support of Riot.</p>\n<p>Whether you're a venue owner, content creator, or simply the go-to person in your scene, the Watch Party Program is your chance to bring the excitement of VCT Americas to your city.</p>\n<p>To begin, Riot is conducting a community outreach campaign through its official channels. If you have hosted a watch party before and are interested in being a part of the Watch Party Program, please fill out this form to submit your application. You will be notified via email if you have been approved to host an official VCT Americas watch party.</p>\n<p>The first official parties will be held during the VCT Americas Stage 1 Finals, with more to follow throughout the VCT 2025 season:</p>\n<ul>\n  <li>Masters Toronto</li>\n  <li>VCT Americas Stage 2 Finals</li>\n  <li>VALORANT Champions Paris</li>\n</ul>\n<p>Whether you're ready to host or just want to attend a party in your area, stay tuned to our VCT Americas channels for updates and information. Let's come together to make this season unforgettable!</p>"
    },
    {
        "title": "April Fools: Smite 2 Reveal",
        "category": "GAME UPDATES",
        "date": "1/4/2025",
        "thumbnail": "https://cmsassets.rgpub.io/sanity/images/dsfx7636/news/2b0e7b3491c9ad54a5f508294d7d8f5c7be78bc9-1920x1080.jpg?auto=format&fit=fill&q=80&w=480",
        "content": "<p>On September 23, 2020, history was made. We released the Smite bundle which became one of the most beloved skins of all time. To this day, we continue to receive numerous compliments and unending love for Smite, easily being one of the best skins we’ve ever designed.</p>\n<p>We’re excited to announce that we’ll be releasing Smite 2 which will appear in the Rotating Store starting April 1st until forever - and yes, it’s somehow even better than the first one. We’ve really outdone ourselves this time.</p>\n<p>We’ve also prepared a few items to further memorialize Smite and celebrate Smite 2 - which will quickly become everyone’s new favorite skin.</p>\n<p>If you log in between the following times, you’ll be granted a free Blue Smite Buddy.</p>\n<ul>\n  <li>April 1st @ 2:00 PM PT - April 14th @ 2:00 PM PT</li>\n</ul>\n<p>Separately, we will grant a free Gold Smite Buddy to everyone who owns any Smite or Bolt item between the following times:</p>\n<ul>\n  <li>April 24 @ 3:00 PM PT - June 1 @ 3:00 PM PT</li>\n</ul>\n<p>The Smite and Bolt items include:</p>\n<ul>\n  <li><strong>Smite1</strong>\n    <ul>\n      <li>Classic</li>\n      <li>Judge</li>\n      <li>Phantom</li>\n      <li>Odin</li>\n      <li>Melee (Knife)</li>\n    </ul>\n  </li>\n  <li><strong>Smite2</strong>\n    <ul>\n      <li>Vandal</li>\n      <li>Outlaw</li>\n      <li>Bucky</li>\n      <li>Ghost</li>\n      <li>Melee (Hammer)</li>\n    </ul>\n  </li>\n  <li><strong>Bolt</strong>\n    <ul>\n      <li>Phantom</li>\n      <li>Outlaw</li>\n      <li>Spectre</li>\n      <li>Frenzy</li>\n      <li>Melee (Knife)</li>\n      <li>Bolt Buddy</li>\n      <li>Bolt Card</li>\n      <li>Bolt Spray</li>\n      <li>Bolt Totem</li>\n    </ul>\n  </li>\n</ul>\n<p>Don’t have a Smite or Bolt weapon? Don’t worry, the following bundles will be available for you:</p>\n<ul>\n  <li>Smite Bundle will be available in the Rotating Store from April 1st to…forever.</li>\n  <li>Bolt Bundle will be available as a Featured Bundle from April 2nd to April 24th, 2 PM PT.</li>\n</ul>\n<p>The legacy of Smite has made an everlasting impact on VALORANT and one day, we’ll regale our children with stories of this legend.</p>"
    },
    {
        "title": "VALORANT Patch Notes 10.06",
        "category": "GAME UPDATES",
        "date": "1/4/2025",
        "thumbnail": "https://cmsassets.rgpub.io/sanity/images/dsfx7636/news/f8d663f096bd319dffdc300edcfc2185fa8a41c5-1920x1080.jpg?auto=format&fit=fill&q=80&w=480",
        "content": "<p>Hey folks, it’s Ash!</p>\n<p>For patch 10.06, we’re looking at a nice lil buff for KAY/O that introduces a new mechanic to his flashes causing them to pop earlier upon bouncing. KAY/O’s resurrection time has also gone down by half, so you’ll no longer have to yell at your teammate to watch your back as you res…well you’ll be yelling for half as long at least.</p>\n<p>There’s also a bunch of bug fixes. For those of you on console who may have seen that you’re not getting progress at the end of each game—don’t worry, it’s a visual bug and you are still getting your progress!</p>\n<p>Lastly, we’re adding 4 extra teleporters on Bind and none of them are connected so entering any of them will shoot you out at 1 of the other 5 locations at random. Please let us know how you feel about it!</p>\n<p>Until next time, happy gaming and don’t forget to 1, 2, 3, flash!</p>\n<p>(The last one is an April Fools’ joke btw, please don’t kill me)</p>\n<h3>ALL PLATFORMS</h3>\n<h4>AGENT UPDATES</h4>\n<ul>\n  <li><strong>KAY/O</strong>\n    <ul>\n      <li><strong>FLASH/DRIVE</strong>\n        <ul>\n          <li>Upon bouncing, flashes will now start a 0.8 second windup and then pop.</li>\n          <li>This windup has unique audio and visuals when triggered.</li>\n          <li>The bounce windup will not be triggered if already less than 0.8 seconds from popping.</li>\n          <li>Underhand max flash duration: 1.25s → 1.5s</li>\n          <li>Increased VO callout range: 20m → 50m</li>\n          <li>Unequip time: 0.85s → 0.6s</li>\n          <li>Minimap indicator added (teammates only)</li>\n        </ul>\n      </li>\n      <li><strong>NULL/cmd</strong>: Ally resurrection time: 3s → 1.5s</li>\n    </ul>\n  </li>\n  <li><strong>Yoru</strong>: Fakeout cost: 100 → 200 credits</li>\n  <li><strong>Vyse</strong>\n    <ul>\n      <li><strong>Razorvine</strong>: Duration 10s → 6s</li>\n      <li><strong>Shear</strong>: Triggered wall duration 8s → 6s</li>\n    </ul>\n  </li>\n</ul>\n<h4>PLAYER BEHAVIOR UPDATES</h4>\n<ul>\n  <li>Improved feedback notifications when cheating reports lead to bans.</li>\n</ul>\n<h4>PERFORMANCE UPDATES</h4>\n<ul>\n  <li>Improved CPU performance of Sunset map.</li>\n</ul>\n<h4>BUG FIXES</h4>\n<ul>\n  <li><strong>Agents</strong>\n    <ul>\n      <li><strong>Vyse</strong> – Arc Rose idle animation and cooldown bugs fixed.</li>\n      <li><strong>Raze</strong> – Blast Pack no longer knocks Skye/Tejo drones through walls.</li>\n      <li><strong>Clove</strong> – Tooltip updates for Meddle.</li>\n      <li><strong>Deadlock</strong> – Loud cocoon confirm sound fixed.</li>\n      <li><strong>Breach</strong> – Aftershock idle animation bug fixed.</li>\n      <li><strong>Sova</strong> – Owl Drone exit animation bug fixed.</li>\n      <li><strong>KAY/O</strong> – Downed posture and dagger trajectory bugs fixed.</li>\n      <li><strong>Gekko</strong> – Wingman VO fix on Spike destruction.</li>\n      <li><strong>Iso</strong> – Double Tap UI display fix for spectators.</li>\n      <li><strong>Tejo</strong> – Stealth Drone unstealth bug on jump fixed.</li>\n      <li><strong>Yoru</strong> – Fakeout Clone tether bug fixed with Fade's Seize.</li>\n    </ul>\n  </li>\n</ul>\n<h3>PC ONLY</h3>\n<h4>BUG FIXES</h4>\n<ul>\n  <li><strong>Premier</strong>\n    <ul>\n      <li>Fixed roster list overlap bug with alert icons.</li>\n      <li>Fixed playoff bracket not updating in Best-of-3 series.</li>\n    </ul>\n  </li>\n</ul>"
    },
    {
        "title": "Watch the VCT Americas 2025 Stage 1 Trailer",
        "category": "ESPORTS",
        "date": "21/3/2025",
        "thumbnail": "https://cmsassets.rgpub.io/sanity/images/dsfx7636/news/835603e3cb18f8f19002c248e8671d357f4b62e3-1920x1080.jpg?auto=format&fit=fill&q=80&w=480",
        "content": "",
        "youtube": "https://www.youtube.com/watch?v=hU1Y5yjgd00"
    },
    {
        "title": "Pros Make Player Tier Lists",
        "category": "ESPORTS",
        "date": "20/3/2025",
        "thumbnail": "https://cmsassets.rgpub.io/sanity/images/dsfx7636/news/ea27896f13f44e2daea73d39ac78cf109e5dc26d-1920x1080.jpg?auto=format&fit=fill&q=80&w=480",
        "content": "",
        "youtube": "https://www.youtube.com/watch?v=MVFxibCb5Kk"
    },
    {
        "title": "Masters Toronto: Live audience and ticket sale information",
        "category": "ESPORTS",
        "date": "18/3/2025",
        "thumbnail": "https://cmsassets.rgpub.io/sanity/images/dsfx7636/news/e9a783f5d8f6a11792ef5eb090d78da605cb1655-1920x1080.jpg?auto=format&fit=fill&q=80&w=480",
        "content": "Masters Toronto is coming! Get all the details about live audience access and ticket sales for this exciting event."
    },
    {
        "title": "VALORANT Patch Notes 10.05",
        "category": "GAME UPDATES",
        "date": "18/3/2025",
        "thumbnail": "https://cmsassets.rgpub.io/sanity/images/dsfx7636/news/91281d11585af58e5906204140aee4cbdf5a34a0-1920x1080.jpg?auto=format&fit=fill&q=80&w=480",
        "content": "Patch 10.05 is here! Dive into the latest updates, including new features, bug fixes, and gameplay adjustments."
    },
    {
        "title": "VCT 2025 Stage 1 Hype Trailer",
        "category": "ESPORTS",
        "date": "13/3/2025",
        "thumbnail": "https://cmsassets.rgpub.io/sanity/images/dsfx7636/news/f96ae76c8e4e36058e827981e6189da40568fc42-1920x1080.jpg?auto=format&fit=fill&q=80&w=480",
        "content": "Feel the excitement with the VCT 2025 Stage 1 Hype Trailer. Get ready for an unforgettable season of competitive VALORANT."
    }, 
    {
        "title": "VCT Americas 2025 Stage 1: Everything You Need to Know",
        "category": "ESPORTS",
        "date": "7/3/2025",
        "thumbnail": "https://cmsassets.rgpub.io/sanity/images/dsfx7636/news_live/44ca25a7626facb734063269c3a57f899b1fd965-1920x1080.jpg?auto=format&fit=crop&q=80&h=270&w=480&crop=center",
        "content": "Explore the vibrant art created by our talented community. From fan art to creative projects, celebrate the spectrum of colors in Waylay."
    }
]