[
    {
        "title": "NA VALORANT Console Open: Everything You Need to Know",
        "category": "ESPORTS",
        "date": "2/5/2025",
        "thumbnail": "https://cmsassets.rgpub.io/sanity/images/dsfx7636/news_live/1485fd40313ee6112bf4548911e8fec225c7c3ed-1920x1080.jpg?auto=format&fit=max&w=1920",
        "content": "<h3>Overview:</h3>\n<p>Console VALORANT teams began the year with the inaugural NA VALORANT Console Open in January. Now, all North American console teams have another shot at claiming the title of the best console VALORANT team as the event returns for its second rendition in May.</p>\n<p><strong>The Avengers</strong>, led by NBA Lig, conquered January’s event in spectacular style. Will the team stick together and seek back-to-back wins? Will their past opponents take their revenge? Or will a new team establish their place at the top of the region?</p>\n<p>The NA VALORANT Console Open will celebrate VALORANT’s 5-year anniversary and is open to all North American console players. Are you up for the challenge?</p>\n\n<h3>Tournament Format and Schedule:</h3>\n<p>The NA VALORANT Console Open starts with a double-elimination bracket featuring all registered and eligible teams. All matches of the double-elimination bracket will be best-of-1 matches in the Competitive game mode. The double-elimination portion of the event will span over 2 days with the 4 remaining teams advancing to the third day of competition.</p>\n<p>The final 4 teams on the third day of competition will be placed in a single-elimination bracket consisting of 2 semifinals and a championship match to determine a winner.</p>\n<p>In addition to the intense competition on the third day, teams and players will be competing for <strong>Bounties</strong>, additional objectives and accomplishments that earn them more prizing.</p>\n<p><strong>Event Schedule:</strong></p>\n<ul>\n  <li>Day 1: May 16 at 7:00 PM ET (4:00 PM PT)</li>\n  <li>Day 2: May 17 at 1:00 PM ET (10:00 AM PT)</li>\n  <li>Day 3 (Finals): May 18 at 1:00 PM ET (10:00 AM PT)</li>\n</ul>\n\n<h3>How to Play:</h3>\n<p>The NA Console VALORANT Open is open to all console players in North America. Assemble your team and register to compete!</p>\n<p><strong>Registration Deadline:</strong> May 16 at 1:00 PM ET (10:00 AM PT)</p>\n<p><strong>Register here:</strong> <a href=\"https://start.gg/NACONSOLEOPEN\">start.gg/NACONSOLEOPEN</a></p>\n<p>Registration requires a full team of 5 players. Need more teammates? Join the VALORANT LFG Discord: <a href=\"https://discord.com/invite/valorantlfg\">discord.com/invite/valorantlfg</a></p>\n\n<h3>Where to Watch:</h3>\n<p>Day 3 of the NA VALORANT Console Open will be streamed in English on:</p>\n<ul>\n  <li><strong>Twitch:</strong> <a href=\"https://twitch.tv/valorant_americas\">/valorant_americas</a></li>\n  <li><strong>YouTube:</strong> <a href=\"https://youtube.com/@valorant_americas\">@valorant_americas</a></li>\n</ul>\n<p>Viewers will play an active role in deciding the winners of some Bounty prizes—be sure to follow all the action during the semifinals and championship and let your voice be heard!</p>\n\n<h3>Socials:</h3>\n<p>Stay up to date on all things NA VALORANT Console Open:</p>\n<ul>\n  <li><strong>X (formerly Twitter):</strong> <a href=\"https://x.com/erenagg\">@erenagg</a></li>\n  <li><strong>Instagram:</strong> <a href=\"https://instagram.com/erenahq\">@erenahq</a></li>\n</ul>\n\n<h3>Partners:</h3>\n<p>Riot is excited to partner with <strong>eFuse</strong> again to cover tournament operations and broadcast for the NA VALORANT Console Open and deliver another action-packed event for both fans and players.</p>\n<p>Social coverage from eFuse: <a href=\"https://x.com/erenaGG\">x.com/erenaGG</a></p>"
    },
    {
        "title": "Act 3 Kickoff Trailer",
        "category": "GAME UPDATES",
        "date": "30/4/2025",
        "thumbnail": "https://cmsassets.rgpub.io/sanity/images/dsfx7636/news_live/cca62b2e455a4af408090a83907ff7b085725b58-1920x1080.jpg?auto=format&fit=crop&q=80&h=270&w=480&crop=center",
        "content": "",
        "youtube": "https://www.youtube.com/watch?v=Xe5b-9BEQTs"
    },
    {
        "title": "Celebrating 5 Years of VALORANT",
        "category": "DEV",
        "date": "29/4/2025",
        "thumbnail": "https://cmsassets.rgpub.io/sanity/images/dsfx7636/news_live/0a5a04311d3566c4fe19fadb7b03f3c82bf0facd-1920x1080.jpg?auto=format&fit=crop&q=80&h=270&w=480&crop=center",
        "content": "",
        "youtube": "https://www.youtube.com/watch?v=ywRzBumomAU"
    },
    {
        "title": "VALORANT Patch Notes 10.08",
        "category": "GAME UPDATES",
        "date": "29/4/2025",
        "thumbnail": "https://cmsassets.rgpub.io/sanity/images/dsfx7636/news_live/f4a95503636b477770b7cc4d8ca2bd9fe369f4f4-1920x1080.jpg?auto=format&fit=fill&q=80&w=1184",
        "content": "<p>Hey, everyone. It’s Kenny here, wishing you a warm welcome to Act III of Season 2025 and Patch 10.08.</p>\n<p>This patch brings some Agent balance updates for Brim, Astra, and Yoru, plus the long-awaited Gifting functionality to the Featured Store, and a slew of bug fixes.</p>\n<p>Oh, and you might catch a little nostalgia if you listen to the music throughout the game. That Episode 1 menu music really takes me back…</p>\n<p>Ok, that’s all from me. GL HF, gamers!</p>\n<h3>ALL PLATFORMS</h3>\n<h4>CLIENT UPDATES</h4>\n<p>In celebration of VALORANT’s fifth anniversary, we are bringing some of the Episode 1 music back in patches 10.08 and 10.09. This includes music for the menus, character select, and Victory/Defeat.</p>\n<h4>GENERAL UPDATES</h4>\n<h5>Gifting Now Available</h5>\n<p>With Patch 10.08, gifting is officially live. Starting with the first bundle of the Act, players can now send select Featured Store bundles and items directly to friends.</p>\n<p><strong>How to Gift:</strong></p>\n<ul>\n  <li>Navigate to the Store</li>\n  <li>Open the details page for the Featured bundle or item</li>\n  <li>Click the Gift button in the bottom-right corner</li>\n  <li>Select your recipient (restrictions apply)</li>\n  <li>Choose to gift the full bundle or individual items</li>\n  <li>Send your gift!</li>\n</ul>\n<p>Your recipient will be prompted to accept or decline the gift the next time they log in to VALORANT.</p>\n<p>Gifting is currently limited to Featured Store items, with expanded support planned for future updates.</p>\n<p>For full details and gifting requirements, visit our Player Support site.</p>\n<h5>Ranked Gun Buddy Coming Soon!</h5>\n<p>Act III starts today! So we want to remind everyone that this is your last Act to grind before ranked buddies are distributed with Patch 11.00 at the start of Act IV.</p>\n<p>After Act III ends, you’ll receive a ranked gun buddy based on the highest rank you achieved throughout the first three acts of Season 2025.</p>\n<h4>MAP UPDATES</h4>\n<p><strong>New Map Rotation</strong></p>\n<ul>\n  <li><strong>SUNSET</strong> is back IN the COMPETITIVE and DEATHMATCH queues.</li>\n  <li><strong>FRACTURE</strong> is OUT of the COMPETITIVE and DEATHMATCH queues.</li>\n</ul>\n<h4>AGENT UPDATES</h4>\n<ul>\n  <li><strong>Brimstone:</strong> Incendiary - molotov audio updated to be easier to hear under smokes.</li>\n  <li><strong>Astra:</strong> Nova Pulse stun duration: 4s → 3.5s</li>\n  <li><strong>Yoru:</strong> Dimensional Drift duration reduced 12s → 10s; Point cost increased 7 → 8</li>\n</ul>\n<h4>BUG FIXES</h4>\n<h5>Agents</h5>\n<ul>\n  <li><strong>Waylay:</strong> Fixed reactivation bug after Convergent Paths.</li>\n  <li><strong>Harbor:</strong> Fixed bracelet VFX bleeding through walls.</li>\n  <li><strong>Deadlock:</strong> Fixed Barrier Mesh audio and boost exploits.</li>\n  <li><strong>Vyse:</strong> Fixed issues with Arc Rose, Shear wall visuals and blocking, Steel Garden indicators.</li>\n  <li><strong>Yoru:</strong> Reverted fix causing clone movement mismatch.</li>\n  <li><strong>Skye & Gekko:</strong> Fixed Trailblazer/Thrash not slowed by Saturate debuff.</li>\n  <li><strong>Tejo:</strong> Fixed boosting and tagging issues with Stealth Drone; fixed Armageddon VFX and indicator bugs.</li>\n  <li><strong>Reyna:</strong> Fixed Devour Overheal not interrupted correctly.</li>\n  <li><strong>Iso:</strong> Updated tooltip for Double Tap reload speed buff.</li>\n</ul>\n<h4>KNOWN ISSUES</h4>\n<h5>Cosmetics</h5>\n<p>We're aware of an issue in the Act III Battlepass where some Player Cards show incorrect names. A fix will arrive in Patch 10.09.</p>\n<h3>PC ONLY</h3>\n<h4>PREMIER UPDATES</h4>\n<p>Welcome to Stage V25A3! Matches start on May 7.</p>\n<p>Premier Restrictions updated: Disruptive players now face custom ineligibility periods based on misconduct severity and intervention duration.</p>\n<h4>BUG FIXES</h4>\n<ul>\n  <li>Lowered hover text size for Rank Shields on the Summary screen.</li>\n</ul>\n<h3>CONSOLE ONLY</h3>\n<h4>BUG FIXES</h4>\n<ul>\n  <li>Fixed overlap in the Timeline screen with long player names.</li>\n  <li>Fixed missing rank requirement text on the Act Rank screen.</li>\n  <li>Updated Act Rank screen language to refer to Seasons.</li>\n</ul>"
    },
    {
        "title": "Tune In To #VCTAmericas LIVE!",
        "category": "ESPORTS",
        "date": "24/4/2025",
        "thumbnail": "https://cmsassets.rgpub.io/sanity/images/dsfx7636/news_live/385d0a58e256d11ba7f42df1336595ba8b7e153d-1920x1080.jpg?auto=format&fit=fill&q=80&w=480",
        "content": "",
        "youtube": "https://www.youtube.com/watch?v=XEm9tWzpRBs"
    },
    {
        "title": "VALORANT Patch Notes 10.07",
        "category": "GAME UPDATES",
        "date": "15/4/2025",
        "thumbnail": "https://cmsassets.rgpub.io/sanity/images/dsfx7636/news/1c1776bd1bdd921061a53953d81a393ef69ce633-1920x1080.jpg?auto=format&fit=fill&q=80&w=1184",
        "content": "<p>Rise and shine, gamers, another patch has dropped!</p>\n<p>Lots of bug fixes for PC and console—fixes for nine Agents and some UI improvements here and there. For console, you can now see the Timeline view as part of the End of Game and Match Details screens where you can review the events of the match round by round (for Competitive, Swiftplay, and Unrated).</p>\n<p>Hope everyone has been keeping up with VCT because there’s only 1 month left before we know who’s moving on to Masters Toronto. What team are you rooting for?</p>\n<p>Have a good one!</p>\n<p>-Ash</p>\n<h3>ALL PLATFORMS</h3>\n<h4>BUG FIXES</h4>\n<h5>Agents</h5>\n<ul>\n  <li><strong>Reyna</strong><br>Fixed an issue where Reyna’s ultimate visuals could show through nearsights.</li>\n  <li><strong>Waylay</strong>\n    <ul>\n      <li>Fixed an issue so Waylay will teleport properly back if she activates her Refract while picking up an ult orb.</li>\n      <li>Fixed an issue where Waylay could activate Refract outside of the playable space on Abyss.</li>\n      <li>Fixed an issue so Waylay should no longer end looking straight up in the air when she triggers Refract return when she's directly above the teleport point.</li>\n    </ul>\n  </li>\n  <li><strong>KAY/O</strong><br>Fixed an issue where KAY/O’s revive SFX would persist after being killed while being resurrected by an ally during NULL/CMD.</li>\n  <li><strong>Vyse</strong>\n    <ul>\n      <li>Fixed an issue where enemies could get stuck inside Vyse’s wall if the wall was overlapping with a smoke ability at specific times.</li>\n      <li>Fixed an issue where enemies could get stuck in Vyse’s Shear if they jumped when it was triggered.</li>\n      <li>Fixed an issue where Vyse’s Shear’s SFX could get stuck playing for enemies after moving out of range or if Vyse dies.</li>\n    </ul>\n  </li>\n  <li><strong>Clove</strong><br>Fixed an issue where Clove’s Ruse battlefield view could be seen from underneath elevated locations while they have it equipped.</li>\n  <li><strong>Cypher</strong><br>Fixed an issue where opponents who teleported out of the Trapwire after being hit could run through the same reactivated wire without getting tethered.</li>\n  <li><strong>Tejo</strong><br>Fixed an issue where Armageddon’s floor indicator persisted across rounds.</li>\n  <li><strong>Omen</strong><br>Fixed an issue where Omen could not see properly when casting Dark Cover if he was overlapping another dense smoke.</li>\n  <li><strong>Clove</strong><br>Fixed an issue where Clove’s Pick-Me-Up duration was incorrect for observer/spectator clients.</li>\n  <li><strong>Deadlock</strong><br>Fixed an issue where Deadlock’s netted VFX could show through thin walls.</li>\n  <li><strong>Sova</strong><br>Fixed an issue where Sova’s arm and Drone overlapped each other in Agent Select.</li>\n  <li><strong>Chamber</strong><br>Fixed an issue where Chamber’s watch and glasses could be seen while nearsighted.</li>\n</ul>\n<h5>General</h5>\n<ul>\n  <li>Fixed a bug that caused the Bolt weapons skin to sometimes glow brighter than intended and cause some photosensitivity issues.</li>\n</ul>\n<h3>PC ONLY</h3>\n<h4>BUG FIXES</h4>\n<ul>\n  <li><strong>Competitive Updates</strong><br>Fixed an issue in Match History and End of Game screens where hover text was missing from the Rank Shield icon if you had no Rank Shields remaining.</li>\n  <li><strong>Player Behavior</strong><br>Fixed an issue where Riot IDs written in certain languages were displayed with a cutoff in the Social Panel.</li>\n  <li><strong>Premier</strong><br>Fixed an issue where text sometimes did not fit in dropdowns on the Standings page.</li>\n</ul>\n<h3>CONSOLE ONLY</h3>\n<h4>COMPETITIVE UPDATES</h4>\n<ul>\n  <li>We’ve added the Timeline view as part of the End of Game and Match Details screens where you can review the events of the match round by round. This view is only available for Competitive, Swiftplay, and Unrated matches.</li>\n</ul>\n<h4>BUG FIXES</h4>\n<ul>\n  <li><strong>Agents</strong><br>Omen: Fixed an issue where Omen’s Dark Cover targeting sensitivity could get stuck at a lower value until his next smoke cast if he died while attempting to cast Dark Cover.</li>\n  <li><strong>Competitive Updates</strong><br>Fixed an issue on the leaderboard page where repeatedly switching between the filters and scrolling through entries on the page could cause you to lose the ability to select a different entry.</li>\n  <li><strong>Player Behavior</strong>\n    <ul>\n      <li>Fixed an issue where players with long usernames overlapped with console logos in the Social Panel.</li>\n      <li>Fixed an issue where sending a party invite to an Invalid Riot ID would lock the invite window until it was closed and reopened.</li>\n    </ul>\n  </li>\n</ul>"
    },
    {
        "title": "VCT Ascended team bundles are now available",
        "category": "GAME UPDATES",
        "date": "9/4/2025",
        "thumbnail": "https://cmsassets.rgpub.io/sanity/images/dsfx7636/news/55466235d285ed40d7efcbbec2f94aff1c0f5bea-1920x1080.jpg?auto=format&fit=max&w=1920",
        "content": "<p>The ascended teams are joining the 2025 VCT Team Capsules collection! This time, let’s give a warm welcome to:</p>\n<ul>\n  <li>2Game Esports (Americas)</li>\n  <li>Apeks (EMEA)</li>\n  <li>Xi Lai Gaming (CN)</li>\n  <li>Nongshim Redforce and BOOM Esports (Pacific)</li>\n</ul>\n<p>This new wave of team bundles includes the same features the VCT partnered team capsules released earlier this year.</p>\n<p><strong>Here’s what you can expect in each Team Capsule:</strong></p>\n<ul>\n  <li>Upgraded Classic Skin with team-themed design and new branding elements.</li>\n  <li>Achievement Tracker Inspect for teams with the accolades of major victories.</li>\n  <li>2025 Player Card with a premium finish, showcasing team identity and creativity.</li>\n  <li>Spray and Gun Buddy to show which teams you support.</li>\n</ul>\n<h3>When Can You Grab Them?</h3>\n<p>The 2025 Ascended Team Capsules will be available throughout the season in the in-game Esports Store.</p>"
    },
    {
        "title": "Introducing the VCT Americas Watch Party Program",
        "category": "ESPORTS",
        "date": "8/4/2025",
        "thumbnail": "https://cmsassets.rgpub.io/sanity/images/dsfx7636/news/5779bcf249685b1fb73b473fc1f35bcd42985c3f-1920x1080.jpg?auto=format&fit=max&w=1920",
        "content": "<p>The VCT Americas Watch Party Program is officially launching, and it's all about you: the fans.</p>\n<p>Riot Games invites VALORANT fans, community leaders, and local businesses from North America, Latin America, and Brazil to join us in creating unforgettable watch party experiences with the support of Riot.</p>\n<p>Whether you're a venue owner, content creator, or simply the go-to person in your scene, the Watch Party Program is your chance to bring the excitement of VCT Americas to your city.</p>\n<p>To begin, Riot is conducting a community outreach campaign through its official channels. If you have hosted a watch party before and are interested in being a part of the Watch Party Program, please fill out this form to submit your application. You will be notified via email if you have been approved to host an official VCT Americas watch party.</p>\n<p>The first official parties will be held during the VCT Americas Stage 1 Finals, with more to follow throughout the VCT 2025 season:</p>\n<ul>\n  <li>Masters Toronto</li>\n  <li>VCT Americas Stage 2 Finals</li>\n  <li>VALORANT Champions Paris</li>\n</ul>\n<p>Whether you're ready to host or just want to attend a party in your area, stay tuned to our VCT Americas channels for updates and information. Let's come together to make this season unforgettable!</p>"
    },
    {
        "title": "April Fools: Smite 2 Reveal",
        "category": "GAME UPDATES",
        "date": "1/4/2025",
        "thumbnail": "https://cmsassets.rgpub.io/sanity/images/dsfx7636/news/2b0e7b3491c9ad54a5f508294d7d8f5c7be78bc9-1920x1080.jpg?auto=format&fit=fill&q=80&w=1184",
        "content": "<p>On September 23, 2020, history was made. We released the Smite bundle which became one of the most beloved skins of all time. To this day, we continue to receive numerous compliments and unending love for Smite, easily being one of the best skins we’ve ever designed.</p>\n<p>We’re excited to announce that we’ll be releasing Smite 2 which will appear in the Rotating Store starting April 1st until forever - and yes, it’s somehow even better than the first one. We’ve really outdone ourselves this time.</p>\n<p>We’ve also prepared a few items to further memorialize Smite and celebrate Smite 2 - which will quickly become everyone’s new favorite skin.</p>\n<p>If you log in between the following times, you’ll be granted a free Blue Smite Buddy.</p>\n<ul>\n  <li>April 1st @ 2:00 PM PT - April 14th @ 2:00 PM PT</li>\n</ul>\n<p>Separately, we will grant a free Gold Smite Buddy to everyone who owns any Smite or Bolt item between the following times:</p>\n<ul>\n  <li>April 24 @ 3:00 PM PT - June 1 @ 3:00 PM PT</li>\n</ul>\n<p>The Smite and Bolt items include:</p>\n<ul>\n  <li><strong>Smite1</strong>\n    <ul>\n      <li>Classic</li>\n      <li>Judge</li>\n      <li>Phantom</li>\n      <li>Odin</li>\n      <li>Melee (Knife)</li>\n    </ul>\n  </li>\n  <li><strong>Smite2</strong>\n    <ul>\n      <li>Vandal</li>\n      <li>Outlaw</li>\n      <li>Bucky</li>\n      <li>Ghost</li>\n      <li>Melee (Hammer)</li>\n    </ul>\n  </li>\n  <li><strong>Bolt</strong>\n    <ul>\n      <li>Phantom</li>\n      <li>Outlaw</li>\n      <li>Spectre</li>\n      <li>Frenzy</li>\n      <li>Melee (Knife)</li>\n      <li>Bolt Buddy</li>\n      <li>Bolt Card</li>\n      <li>Bolt Spray</li>\n      <li>Bolt Totem</li>\n    </ul>\n  </li>\n</ul>\n<p>Don’t have a Smite or Bolt weapon? Don’t worry, the following bundles will be available for you:</p>\n<ul>\n  <li>Smite Bundle will be available in the Rotating Store from April 1st to…forever.</li>\n  <li>Bolt Bundle will be available as a Featured Bundle from April 2nd to April 24th, 2 PM PT.</li>\n</ul>\n<p>The legacy of Smite has made an everlasting impact on VALORANT and one day, we’ll regale our children with stories of this legend.</p>"
    },
    {
        "title": "VALORANT Patch Notes 10.06",
        "category": "GAME UPDATES",
        "date": "1/4/2025",
        "thumbnail": "https://cmsassets.rgpub.io/sanity/images/dsfx7636/news/f8d663f096bd319dffdc300edcfc2185fa8a41c5-1920x1080.jpg?auto=format&fit=fill&q=80&w=1184",
        "content": "<p>Hey folks, it’s Ash!</p>\n<p>For patch 10.06, we’re looking at a nice lil buff for KAY/O that introduces a new mechanic to his flashes causing them to pop earlier upon bouncing. KAY/O’s resurrection time has also gone down by half, so you’ll no longer have to yell at your teammate to watch your back as you res…well you’ll be yelling for half as long at least.</p>\n<p>There’s also a bunch of bug fixes. For those of you on console who may have seen that you’re not getting progress at the end of each game—don’t worry, it’s a visual bug and you are still getting your progress!</p>\n<p>Lastly, we’re adding 4 extra teleporters on Bind and none of them are connected so entering any of them will shoot you out at 1 of the other 5 locations at random. Please let us know how you feel about it!</p>\n<p>Until next time, happy gaming and don’t forget to 1, 2, 3, flash!</p>\n<p>(The last one is an April Fools’ joke btw, please don’t kill me)</p>\n<h3>ALL PLATFORMS</h3>\n<h4>AGENT UPDATES</h4>\n<ul>\n  <li><strong>KAY/O</strong>\n    <ul>\n      <li><strong>FLASH/DRIVE</strong>\n        <ul>\n          <li>Upon bouncing, flashes will now start a 0.8 second windup and then pop.</li>\n          <li>This windup has unique audio and visuals when triggered.</li>\n          <li>The bounce windup will not be triggered if already less than 0.8 seconds from popping.</li>\n          <li>Underhand max flash duration: 1.25s → 1.5s</li>\n          <li>Increased VO callout range: 20m → 50m</li>\n          <li>Unequip time: 0.85s → 0.6s</li>\n          <li>Minimap indicator added (teammates only)</li>\n        </ul>\n      </li>\n      <li><strong>NULL/cmd</strong>: Ally resurrection time: 3s → 1.5s</li>\n    </ul>\n  </li>\n  <li><strong>Yoru</strong>: Fakeout cost: 100 → 200 credits</li>\n  <li><strong>Vyse</strong>\n    <ul>\n      <li><strong>Razorvine</strong>: Duration 10s → 6s</li>\n      <li><strong>Shear</strong>: Triggered wall duration 8s → 6s</li>\n    </ul>\n  </li>\n</ul>\n<h4>PLAYER BEHAVIOR UPDATES</h4>\n<ul>\n  <li>Improved feedback notifications when cheating reports lead to bans.</li>\n</ul>\n<h4>PERFORMANCE UPDATES</h4>\n<ul>\n  <li>Improved CPU performance of Sunset map.</li>\n</ul>\n<h4>BUG FIXES</h4>\n<ul>\n  <li><strong>Agents</strong>\n    <ul>\n      <li><strong>Vyse</strong> – Arc Rose idle animation and cooldown bugs fixed.</li>\n      <li><strong>Raze</strong> – Blast Pack no longer knocks Skye/Tejo drones through walls.</li>\n      <li><strong>Clove</strong> – Tooltip updates for Meddle.</li>\n      <li><strong>Deadlock</strong> – Loud cocoon confirm sound fixed.</li>\n      <li><strong>Breach</strong> – Aftershock idle animation bug fixed.</li>\n      <li><strong>Sova</strong> – Owl Drone exit animation bug fixed.</li>\n      <li><strong>KAY/O</strong> – Downed posture and dagger trajectory bugs fixed.</li>\n      <li><strong>Gekko</strong> – Wingman VO fix on Spike destruction.</li>\n      <li><strong>Iso</strong> – Double Tap UI display fix for spectators.</li>\n      <li><strong>Tejo</strong> – Stealth Drone unstealth bug on jump fixed.</li>\n      <li><strong>Yoru</strong> – Fakeout Clone tether bug fixed with Fade's Seize.</li>\n    </ul>\n  </li>\n</ul>\n<h3>PC ONLY</h3>\n<h4>BUG FIXES</h4>\n<ul>\n  <li><strong>Premier</strong>\n    <ul>\n      <li>Fixed roster list overlap bug with alert icons.</li>\n      <li>Fixed playoff bracket not updating in Best-of-3 series.</li>\n    </ul>\n  </li>\n</ul>"
    },
    {
        "title": "Watch the VCT Americas 2025 Stage 1 Trailer",
        "category": "ESPORTS",
        "date": "21/3/2025",
        "thumbnail": "https://cmsassets.rgpub.io/sanity/images/dsfx7636/news/835603e3cb18f8f19002c248e8671d357f4b62e3-1920x1080.jpg?auto=format&fit=fill&q=80&w=480",
        "content": "",
        "youtube": "https://www.youtube.com/watch?v=hU1Y5yjgd00"
    },
    {
        "title": "Pros Make Player Tier Lists",
        "category": "ESPORTS",
        "date": "20/3/2025",
        "thumbnail": "https://cmsassets.rgpub.io/sanity/images/dsfx7636/news/ea27896f13f44e2daea73d39ac78cf109e5dc26d-1920x1080.jpg?auto=format&fit=fill&q=80&w=480",
        "content": "",
        "youtube": "https://www.youtube.com/watch?v=MVFxibCb5Kk"
    },
    {
        "title": "VALORANT Patch Notes 10.05",
        "category": "GAME UPDATES",
        "date": "18/3/2025",
        "thumbnail": "https://cmsassets.rgpub.io/sanity/images/dsfx7636/news/91281d11585af58e5906204140aee4cbdf5a34a0-1920x1080.jpg?auto=format&fit=fill&q=80&w=1184",
        "content": "<p>Hey, everyone. It’s ya boi Kenny here—back with a small but mighty patch 10.05.</p>\n<p>First and foremost, Ranked Rollbacks are here! Check out the notes below for more detail, and keep an eye on our social channels for a short video showing how this change will show up in your game client.</p>\n<p>Beyond RR Rollbacks, you’ll also notice some minor Bug Fixes for Agents.</p>\n<p>That’s all from me. GL HF GG.</p>\n<h3>ALL PLATFORMS</h3>\n<h4>COMPETITIVE UPDATES</h4>\n<ul>\n  <li><strong>Ranked Rollbacks are live!</strong>\n    <ul>\n      <li>If you lost RR due to a match against a confirmed cheater in the last week, you will be eligible for an RR refund!</li>\n      <li>You will get a pop-up notification showing the exact amount of RR being refunded.</li>\n      <li>To apply the refunded RR, you must complete one Competitive match.</li>\n      <li>Once you finish that match, the refunded RR will be reflected in your End of Game summary screen—win or lose, the refund still gets added to your total RR for that game.</li>\n      <li><strong>Important:</strong> Ranked Rollbacks are only valid within the current Act and there is a cap per Act. If you qualify for a refund, be sure to play a game before the Act ends to claim it!</li>\n    </ul>\n  </li>\n</ul>\n<h4>BUG FIXES</h4>\n<ul>\n  <li><strong>Agents</strong>\n    <ul>\n      <li><strong>Raze:</strong> Fixed a bug where Blast Pack’s explosion was slightly smaller at the tip of the explosion since the explosion changes that went live in 10.03</li>\n      <li><strong>Clove:</strong> Fixed a bug where Clove could take damage or die for a single frame upon reviving with Not Dead Yet</li>\n      <li><strong>Sage:</strong> Resurrection: Fixed the same bug as Clove above where there was a single frame of vulnerability upon reviving a target</li>\n      <li><strong>Tejo:</strong> Fixed a bug where Armageddon’s danger indicator did not always apply on variable elevations</li>\n      <li><strong>Iso:</strong> Fixed a bug where Double Tap’s HUD bar could look visually incorrect for spectators or observers</li>\n      <li><strong>Waylay:</strong>\n        <ul>\n          <li>Fixed a bug where there was a performance hitch upon casting Convergent Paths</li>\n          <li>Fixed a bug where Convergent Paths was unable to be equipped during the buy phase.</li>\n        </ul>\n      </li>\n    </ul>\n  </li>\n  <li><strong>Social:</strong> Fixed an issue where in-game status and scores were not updating as frequently as they should in the social panel.</li>\n  <li><strong>Maps</strong>\n    <ul>\n      <li><strong>Breeze:</strong>\n        <ul>\n          <li>Fixed a bug where abilities would ignore line of sight around crates on A Site.</li>\n          <li>Fixed a bug where flash abilities would be blocked in certain areas on the map.</li>\n        </ul>\n      </li>\n      <li><strong>Sunset:</strong> Fixed a bug where players could not plant the Spike on the B Site crates inside of the plant zone.</li>\n    </ul>\n  </li>\n</ul>\n<h3>CONSOLE ONLY</h3>\n<h4>GENERAL UPDATES</h4>\n<ul>\n  <li>We are disabling Remote Play for PS5 until further notice to investigate an issue. Please keep an eye out on future patch notes for an update!</li>\n</ul>\n<h4>BUG FIXES</h4>\n<ul>\n  <li><strong>Social:</strong> Fixed a bug where it would take several seconds to reconnect to comms when going back to the custom game lobby after match.</li>\n</ul>"
    },
    {
        "title": "VCT 2025 Stage 1 Hype Trailer",
        "category": "ESPORTS",
        "date": "13/3/2025",
        "thumbnail": "https://cmsassets.rgpub.io/sanity/images/dsfx7636/news/f96ae76c8e4e36058e827981e6189da40568fc42-1920x1080.jpg?auto=format&fit=fill&q=80&w=480",
        "content": "",
        "youtube": "https://www.youtube.com/watch?v=jcwAO-RcgUw"
    }, 
    {
        "title": "VCT Americas 2025 Stage 1: Everything You Need to Know",
        "category": "ESPORTS",
        "date": "7/3/2025",
        "thumbnail": "https://cmsassets.rgpub.io/sanity/images/dsfx7636/news_live/44ca25a7626facb734063269c3a57f899b1fd965-1920x1080.jpg?auto=format&fit=max&w=1920",
        "content": "<p>VCT Americas keeps moving forward, and so do the teams chasing their dreams of reaching VALORANT Champions Paris.</p>\n<p>After an intense Masters Bangkok, it’s time to look ahead to VCT Americas Stage 1, where the competition heats up even more. All eyes are on G2, the team that dominated Kickoff 2025 and made it to the Masters Bangkok Grand Final. But the big question remains—can anyone stop them?</p>\n<p>The stakes are even higher now. Stage 1 will determine three teams that will qualify for Masters Toronto, and this time, the Americas teams will have to defend their home turf.</p>\n<p>Who will rise to the challenge? Who will adapt best to the latest changes in the meta? The race to Champions Paris is in full swing, and the world is watching VCT Americas. The fight for regional dominance has never been more intense—every match, every strategy, and every clutch play could make the difference.</p>\n<p>The battle continues on March 21. Are you ready?</p>\n<h3>TOURNAMENT SCHEDULE AND FORMAT</h3>\n<p>In case you missed it, the Stage 1 Draw Show determined the groups and matchups of all 12 teams.</p>\n<p>Here are the Alpha and Omega groups:</p>\n<p>Teams are split into two groups and will compete in a round-robin format within their group. The top four teams from each group advance to playoffs, where the #1 seed earns a Round 1 bye and the #4 seed starts in the Lower Bracket.</p>\n<p>VCT Americas will have four days of matches in an alternate studio during both Stage 1 and Stage 2.</p>\n<h3>BUY TICKETS</h3>\n<p>Experience the excitement of VCT Americas live at the iconic Riot Games Arena in Los Angeles. With hundreds of fans, vibrant LED displays, and an electrifying atmosphere, you’ll be right in the heart of the action as you cheer on your favorite teams all season long.</p>\n<p><strong>Stage 1 Tickets On-Sale Date:</strong></p>\n<p>March 10 at 12pm PT / 3pm ET / 5pm BRT</p>\n<p>To get your tickets, go to <a href=\"https://vctamericas.tixr.com\">vctamericas.tixr.com</a>.</p>\n<p>Matches on April 5, 6, 19, and 20 will be played in another studio at Riot Games Arena without fans.</p>\n<h3>WHERE TO WATCH</h3>\n<p>Catch all the action on Twitch or YouTube! Official VCT Americas broadcasts will be available in English, Spanish, and Portuguese. Broadcast days and times will be updated in real time throughout the season on <a href=\"https://valorantesports.com\">valorantesports.com</a>.</p>\n<h4>English</h4>\n<ul>\n  <li>Twitch - /valorant_americas</li>\n  <li>YouTube - @valorant_americas</li>\n  <li>TikTok - @valesportsna</li>\n</ul>\n<h4>Portuguese</h4>\n<ul>\n  <li>Twitch - /valorant_br</li>\n  <li>YouTube - @valorantesportsbr</li>\n  <li>TikTok - @valesportsbr</li>\n</ul>\n<h4>Spanish</h4>\n<ul>\n  <li>Twitch - /valorant_la</li>\n  <li>YouTube - @valorantesportsla</li>\n</ul>\n<h3>CO-STREAMING</h3>\n<p>Anyone who wishes to host a Watch Party must read and agree to our VCT Co-streaming Guidelines and comply with the following steps in order to gain permission to co-stream the event:</p>\n<ul>\n  <li>If you’re broadcasting from North America, <a href=\"#\">sign up to host a Watch Party here</a>. Your watch party must also comply with the Watch Party Guidelines.</li>\n  <li>If you’re from Latin America and want to co-stream VCT Americas in Spanish, <a href=\"#\">apply to host a Watch Party here</a>.</li>\n  <li>If you’re from Brazil and want to co-stream VCT Americas in Brazilian Portuguese, <a href=\"#\">apply to host a Watch Party here</a>.</li>\n  <li>If you’re broadcasting from anywhere else in the world, <a href=\"#\">sign up to host an International Watch Party here</a>.</li>\n</ul>\n<h3>SOCIAL</h3>\n<p>Stay up to date on all things <strong>#VCTAmericas</strong> across our official social channels.</p>\n<p>Photos on Flickr - /vctamericas</p>\n<h4>English</h4>\n<ul>\n  <li>X (formerly Twitter) - @valesportsna</li>\n  <li>Instagram - @valesportsna</li>\n  <li>TikTok - @valesportsna</li>\n</ul>\n<h4>Portuguese</h4>\n<ul>\n  <li>X (formerly Twitter) - @valesportsbr</li>\n  <li>Instagram - @valesportsbr</li>\n  <li>TikTok - @valesportsbr</li>\n  <li>Facebook - /valorantesportsbr</li>\n</ul>\n<h4>Spanish</h4>\n<ul>\n  <li>X (formerly Twitter) - @valesportsla</li>\n  <li>Instagram - @valesportsla</li>\n  <li>TikTok - @valesportsla</li>\n</ul>\n<h3>PARTNERS</h3>\n<p>We’re excited to welcome back the support of our portfolio of VCT Americas partners that level up the VCT Americas experience with bespoke moments, activations, giveaways for our passionate fanbase:</p>\n<ul>\n  <li><strong>Red Bull:</strong> Official energy drink of VCT, presenting the Red Bull “Clutch Moment” during every match.</li>\n  <li><strong>Aim Labs:</strong> Official training partner of VCT, offering innovative training programs and insights.</li>\n  <li><strong>Secretlab:</strong> Supplier of premium gaming chairs for all VCT pros.</li>\n  <li><strong>Verizon:</strong> Official 5G and wireless services provider of VCT, with sponsored content and Verizon Up rewards.</li>\n  <li><strong>iBUYPOWER:</strong> Official PC partner providing performance-optimized PCs and VCT-branded machines.</li>\n  <li><strong>Samsung SSD:</strong> Memory partner equipping the fleet with 990 PRO SSDs, bringing the “Samsung SSD Match Start.”</li>\n  <li><strong>Pulsar:</strong> Official Mouse, Keyboard, and Mousepad partner offering precision gear for top-tier esports performance.</li>\n</ul>"
    },
    {
        "title": "Best Of VALORANT Masters Bangkok",
        "category": "ESPORTS",
        "date": "7/3/2025",
        "thumbnail": "https://cmsassets.rgpub.io/sanity/images/dsfx7636/news/2bbf45e90b1e165c64a74f1b401c5a5413463b78-1280x720.jpg?auto=format&fit=crop&q=80&h=270&w=480&crop=center",
        "content": "",
        "youtube": "https://www.youtube.com/watch?v=dNf6-Qd6z0k"
    },
    {
        "title": "VALORANT Patch Notes 10.04",
        "category": "GAME UPDATES",
        "date": "4/3/2025",
        "thumbnail": "https://cmsassets.rgpub.io/sanity/images/dsfx7636/news/da3deddfcad907ae5e7581848ecfd724208d9b07-1920x1080.jpg?auto=format&fit=fill&q=80&w=1184",
        "content": "<h3>Hey everyone! It’s Ash here.</h3>\n<p>This is a spicy patch so lock in for these notes.</p>\n\n<h3>Welcome Waylay!</h3>\n<p>Hailing from Thailand, <strong>Waylay</strong> is joining the roster as our newest <strong>Duelist</strong>! We can’t wait to see your gameplay highlights, so get ready to post those insane clutches and aces.</p>\n<p>Major updates also drop for Clove, Deadlock, Iso, and Tejo, with a small VFX change to Neon. <strong>Ascent</strong> and <strong>Icebox</strong> are rotating IN, while <strong>Abyss</strong> and <strong>Bind</strong> are OUT. And for the Odin enjoyers on Ascent—might be time to rethink that B Main hold.</p>\n<p>As always, we’re looking at your feedback so keep it coming. Happy gaming!</p>\n\n<h3>ALL PLATFORMS</h3>\n<h4>AGENT UPDATES</h4>\n<h5>Waylay</h5>\n<ul>\n  <li><strong>Release:</strong> Staggered rollout starting March 5 at 9:00 AM PT</li>\n  <li><strong>Refract:</strong> Instantly create a beacon of light on the floor. Reactivate to zip back, invulnerable, as a mote of pure light.</li>\n  <li><strong>Light Speed:</strong> Dash forward twice (alt-fire dashes once). First dash can send you upward.</li>\n  <li><strong>Saturate:</strong> Throw a light cluster that hinders movement and weapon handling on impact.</li>\n  <li><strong>Convergent Paths:</strong> Fire a beam from an afterimage. After a delay, gain a speed boost and hinder enemies in the beam’s path.</li>\n</ul>\n\n<h5>Clove</h5>\n<ul>\n  <li><strong>Meddle:</strong> No longer explodes on a timer. Now explodes on ground contact after 0.75s.</li>\n  <li><strong>Ruse:</strong> Cooldown increased from 30s to 40s</li>\n  <li><strong>Pick Me Up:</strong> Health buff duration: 8s → 10s; Move speed duration: 8s → 3s</li>\n</ul>\n\n<h5>Deadlock</h5>\n<ul>\n  <li><strong>Barrier Mesh:</strong> Now costs 400 credits (was free)</li>\n  <li><strong>GravNet:</strong> Now signature ability with 40s cooldown; Size reduced (16m → 13m); New audio cues for clarity</li>\n</ul>\n\n<h5>Iso</h5>\n<ul>\n  <li><strong>Undercut:</strong> Charges reduced 2 → 1; Cost increased to 300 credits; Adds suppression + vulnerability</li>\n  <li><strong>Contingency:</strong> Alt-fire for slower wall speed; same duration</li>\n  <li><strong>Double Tap:</strong> Receives Heavy Pen tag (more slow) instead of Wall Pen when shield breaks</li>\n  <li><strong>Kill Contract:</strong> Now always spawns orb if duel is won, regardless of Double Tap buff</li>\n</ul>\n\n<h5>Neon</h5>\n<p>VFX improvements for Overdrive to make directionality more clear.</p>\n\n<h5>Tejo</h5>\n<ul>\n  <li><strong>Guided Salvo:</strong> Damage reduced from 70 → 65; Now does 50% damage to non-player objects (e.g., Killjoy’s Lockdown survives with 5 HP)</li>\n</ul>\n\n<h3>MAP UPDATES</h3>\n<ul>\n  <li><strong>IN:</strong> Ascent, Icebox</li>\n  <li><strong>OUT:</strong> Abyss, Bind</li>\n</ul>\n<p><strong>Ascent – B Main:</strong> Wall now non-pennable to reduce oppressive spam at barrier drop.</p>\n\n<h3>GAMEPLAY SYSTEMS</h3>\n<p>Combat Report visuals overhauled for clearer, more intuitive damage breakdown.</p>\n\n<h3>BUG FIXES</h3>\n<ul>\n  <li><strong>Neon:</strong> Fixed head jiggle issue during slide</li>\n  <li><strong>Fade:</strong> Fixed hand freeze issue when crouching with Nightfall</li>\n  <li><strong>Rank Shield:</strong> Now correctly appears in match history after non-Competitive games</li>\n</ul>\n\n<h3>KNOWN ISSUES</h3>\n<p><strong>Spectating Bug:</strong> First-person camera may appear offset while spectating.</p>\n\n<h3>CONSOLE ONLY</h3>\n<h4>AGENT UPDATES</h4>\n<p>Our philosophy is that VALORANT should feel true across platforms, but adjustments are made when needed based on data and feedback.</p>\n\n<h5>Neon (Console)</h5>\n<ul>\n  <li><strong>Overdrive:</strong> Head damage multiplier increased 2.5 → 3.0; Leg damage 0.75 → 0.85</li>\n  <li><strong>Sprint:</strong> Fuel drain per sec reduced from 0.11 → 0.1</li>\n</ul>\n\n<h5>Yoru (Console)</h5>\n<ul>\n  <li><strong>Dimensional Drift:</strong> Unequip delay: 1.2s → 0.8s</li>\n  <li><strong>Fakeout:</strong> Max flash duration: 2.0s → 3.0s; Flash explosion delay: 0.6s → 0.8s</li>\n  <li><strong>Blindside:</strong> Flash duration: 1.25s → 1.75s; Explosion delay: 0.7s → 0.6s</li>\n</ul>\n\n<h5>Reyna (Console)</h5>\n<ul>\n  <li><strong>Leer Health:</strong> Increased from 40 → 100</li>\n</ul>\n<p>Note: Activation time/duration still +0.2s compared to PC.</p>"
    },
    {
        "title": "Starforged // Cyrax Skin Reveal Trailer - VALORANT",
        "category": "GAME UPDATES",
        "date": "3/3/2025",
        "thumbnail": "https://cmsassets.rgpub.io/sanity/images/dsfx7636/news/83ad122382ccfc925d8b98e692098d1a2f1e8449-1920x1080.jpg?auto=format&fit=crop&q=80&h=270&w=480&crop=center",
        "content": "",
        "youtube": "https://www.youtube.com/watch?v=97eAYyVHsUE"
    }
]